In [2]:
# Importing all needed programs
import os
import json
import numpy
import datetime
import certifi
import pandas as pd

import pymongo
import sqlalchemy
from sqlalchemy import create_engine

In [3]:
# Connecting to SQL and MongoDB Atlas Cluster
mysql_uid = "root"
mysql_pwd = "Passw0rd123"
mysql_hostname = "localhost"


atlas_cluster_name = "sandboxmg.xgonohk" 
atlas_user_name = "vwn6cz"
atlas_password = "QCtFh9wkdTKjlqu0"

conn_str = {"local" : f"mongodb://localhost:27017/", 
            "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net"}
    

src_dbname = "film"
dst_dbname = "sakila"

print(f"Local Connection String: {conn_str['local']}")
print(f"Atlas Connection String: {conn_str['atlas']}")

Local Connection String: mongodb://localhost:27017/
Atlas Connection String: mongodb+srv://vwn6cz:QCtFh9wkdTKjlqu0@sandboxmg.xgonohk.mongodb.net

In [4]:
# Setting functions for getting data from and setting data into databases
def get_sql_dataframe(user_id, pwd, host_name, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"  #{mysql_uid}:{mysql_pwd}@{mysql_hostname}/{northwind_dw2}
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe


def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        connection.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

In [5]:
# Popuating MongoDB with Data extracted from SQL (into json files)

client = pymongo.MongoClient(conn_str['local']) #, tlsCAFile=certifi.where())
db = client[src_dbname]

# Gets the path of the Current Working Directory for this Notebook, and then Appends the 'data' directory.
data_dir = os.path.join(os.getcwd(), 'data')

json_files = {"actor" : 'sakila_actor.json',
              "category" : 'sakila_category.json',
              "film" : 'sakila_film.json'
             }

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile)
        file = db[file]
        result = file.insert_many(json_object)
        #print(f"{file} was successfully loaded.")

        
client.close()

In [6]:
#Extract data from MongoDB collections into source dataframes
query = {} # Select all elements (columns), and all documents (rows).
collection = "actor"

df_actor = get_mongo_dataframe(conn_str['local'], src_dbname, collection, query)
df_actor.head(2)

  first_name last_name  actor_id  film_id          last_update
0   PENELOPE   GUINESS         1        1  2006-02-15 00:05:03
1   PENELOPE   GUINESS         1       23  2006-02-15 00:05:03

In [7]:
query = {} # Select all elements (columns), and all documents (rows).
collection = "category"

df_category = get_mongo_dataframe(conn_str['local'], src_dbname, collection, query)
df_category.head(2)

   category_id    name          last_update  film_id
0            1  Action  2006-02-14 23:46:27       19
1            1  Action  2006-02-14 23:46:27       21

In [8]:
# Get data from the date dimension table
sql_dim_date = "SELECT date_key, full_date FROM sakila.dim_date;"
df_dim_date = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_dim_date)
df_dim_date.full_date = df_dim_date.full_date.astype('datetime64[ns]').dt.date
df_dim_date.head(2)

   date_key   full_date
0  20000101  2000-01-01
1  20000102  2000-01-02

In [9]:
# Lookup the surrogate primary key (date_key) that corresponds to the last_update column in df_actor
df_actor = df_actor.rename(columns={"last_update" : "actor_date_updated"})

df_dim_actor_date = df_dim_date.rename(columns={"date_key" : "actor_date_updated_key", "full_date" : "actor_date_updated"})
df_actor.actor_date_updated = df_actor.actor_date_updated.astype('datetime64[ns]').dt.date
df_actor = pd.merge(df_actor, df_dim_actor_date, on='actor_date_updated', how='left') #getting all rows from left table, and all the matches from the right table
df_actor.drop(['actor_date_updated'], axis=1, inplace=True)
df_actor.head(2)

  first_name last_name  actor_id  film_id  actor_date_updated_key
0   PENELOPE   GUINESS         1        1                20060215
1   PENELOPE   GUINESS         1       23                20060215

In [10]:
# Lookup the surrogate primary key (date_key) that corresponds to the last_update column in df_category
df_category = df_category.rename(columns={"last_update" : "category_date_updated"})

df_dim_category_date = df_dim_date.rename(columns={"date_key" : "category_date_updated_key", "full_date" : "category_date_updated"})
df_category.category_date_updated = df_category.category_date_updated.astype('datetime64[ns]').dt.date
df_category = pd.merge(df_category, df_dim_category_date, on='category_date_updated', how='left') #getting all rows from left table, and all the matches from the right table
df_category.drop(['category_date_updated'], axis=1, inplace=True)
df_category.head(2)

   category_id    name  film_id  category_date_updated_key
0            1  Action       19                   20060214
1            1  Action       21                   20060214

In [11]:
# Perform any necessary transformations to the dataframes

# Creating a primary key for df_actor
df_actor.insert(0, "actor_key", range(1, df_actor.shape[0]+1))
df_actor.head(2)

   actor_key first_name last_name  actor_id  film_id  actor_date_updated_key
0          1   PENELOPE   GUINESS         1        1                20060215
1          2   PENELOPE   GUINESS         1       23                20060215

In [12]:
# Creating a primary key for df_category
df_category.insert(0, "category_key", range(1, df_category.shape[0]+1))
df_category.head(2)

   category_key  category_id    name  film_id  category_date_updated_key
0             1            1  Action       19                   20060214
1             2            1  Action       21                   20060214

In [13]:
# Load the transformed dataframes into the new data warehouse by creating new tables

# Upload the "actor" dataframe to create the new dim_actor dimension table 
dataframe = df_actor
table_name = 'dim_actor'
primary_key = 'actor_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [14]:
# Upload the "category" dataframe to create the new dim_category dimension table 
dataframe = df_category
table_name = 'dim_category'
primary_key = 'category_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [15]:
# Validate that the new dimension tables were created

# Validate the new "dim_actor" table in the sakila data warehouse
sql_actor = "SELECT * FROM sakila.dim_actor;"
df_dim_actor = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_actor)
df_dim_actor.head(2)

   actor_key first_name last_name  actor_id  film_id  actor_date_updated_key
0          1   PENELOPE   GUINESS         1        1                20060215
1          2   PENELOPE   GUINESS         1       23                20060215

In [16]:
# Validate the new "dim_category" table in the sakila data warehouse
sql_category = "SELECT * FROM sakila.dim_category;"
df_dim_category = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_category)
df_dim_category.head(2)

   category_key  category_id    name  film_id  category_date_updated_key
0             1            1  Action       19                   20060214
1             2            1  Action       21                   20060214

In [17]:
# Create and populate the new fact table

# Extract data for your new "Film" Fact Table
query = {} # Select all elements (columns), and all documents (rows).

collection = "film"

df_fact_film = get_mongo_dataframe(conn_str['local'], src_dbname, collection, query)
df_fact_film.head(2)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 00:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 00:03:42

In [18]:
# Lookup the Surrogate Primary Key (date_key) that Corresponds to the "last_update" Column.
df_fact_film = df_fact_film.rename(columns={"last_update" : "film_date_updated"})

df_dim_film_date = df_dim_date.rename(columns={"date_key" : "film_date_updated_key", "full_date" : "film_date_updated"})
df_fact_film.film_date_updated = df_fact_film.film_date_updated.astype('datetime64[ns]').dt.date
df_fact_film = pd.merge(df_fact_film, df_dim_film_date, on='film_date_updated', how='left')
df_fact_film.drop(['film_date_updated'], axis=1, inplace=True)
df_fact_film.head(2)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,film_date_updated_key
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",20060215
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",20060215

In [19]:
# Lookup the primary keys from the dimension tables

# Extract the 'primary key' and the 'business key' from the "dim_actor" dimension table
sql_dim_actor = "SELECT actor_key, actor_id, film_id FROM sakila.dim_actor;"
df_dim_actor_keys = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_dim_actor)
df_dim_actor_keys.head(2)

   actor_key  actor_id  film_id
0          1         1        1
1          2         1       23

In [20]:
# Extract the 'primary key' and the 'business key' from the "dim_category" dimension table
sql_dim_category = "SELECT category_key, category_id, film_id FROM sakila.dim_category;"
df_dim_category_keys = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_dim_category)
df_dim_category_keys.head(2)

   category_key  category_id  film_id
0             1            1       19
1             2            1       21

In [21]:
# Creating merged fact table 
# Merge the "fact_film" and "df_dim_actor" dataframes on the 'film_id'

df_fact_film_actor = pd.merge(df_fact_film, df_dim_actor, on='film_id', how='left')
df_fact_film_actor.head(2)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,film_date_updated_key,actor_key,first_name,last_name,actor_id,actor_date_updated_key
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",20060215,1.0,PENELOPE,GUINESS,1.0,20060215.0
1,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",20060215,213.0,CHRISTIAN,GABLE,10.0,20060215.0

In [22]:
# Merge fact table and "df_dim_category"
df_fact_film_ac = pd.merge(df_fact_film_actor, df_dim_category, on='film_id', how='left')
df_fact_film_ac.head(2)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,...,film_date_updated_key,actor_key,first_name,last_name,actor_id,actor_date_updated_key,category_key,category_id,name,category_date_updated_key
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,...,20060215,1.0,PENELOPE,GUINESS,1.0,20060215.0,306,6,Documentary,20060214
1,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,...,20060215,213.0,CHRISTIAN,GABLE,10.0,20060215.0,306,6,Documentary,20060214

In [24]:
# Perform any necessary transformations to the fact table

# dropping description, language_id, original_language_id, special_features
reordered_columns = ['film_id', 'title', 'release_year', 'rental_duration', 'rental_rate',
                     'length', 'replacement_cost', "rating", 'actor_key',
                     'actor_id', 'first_name', 'last_name', 'category_key',
                     'category_id', 'name', 'category_date_updated_key', 'actor_date_updated_key',
                     "film_date_updated_key"]

df_fact_film = df_fact_film_ac[reordered_columns]

# add a primary key to the fact table
df_fact_film.insert(0, "fact_film_key", range(1, df_fact_film.shape[0]+1))
df_fact_film.head(2)

,fact_film_key,film_id,title,release_year,rental_duration,rental_rate,length,replacement_cost,rating,actor_key,actor_id,first_name,last_name,category_key,category_id,name,category_date_updated_key,actor_date_updated_key,film_date_updated_key
0,1,1,ACADEMY DINOSAUR,2006,6,0.99,86,20.99,PG,1.0,1.0,PENELOPE,GUINESS,306,6,Documentary,20060214,20060215.0,20060215
1,2,1,ACADEMY DINOSAUR,2006,6,0.99,86,20.99,PG,213.0,10.0,CHRISTIAN,GABLE,306,6,Documentary,20060214,20060215.0,20060215

In [25]:
# Load newly transformed mongoDB data into the SQL sakila data warehouse
dataframe = df_fact_film
table_name = 'fact_film'
primary_key = 'fact_film_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [26]:
# Validate that the new fact table was created
sql_fact_film = "SELECT * FROM sakila.fact_film;"
df_fact_film = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_fact_film)
df_fact_film.head(2)

,fact_film_key,film_id,title,release_year,rental_duration,rental_rate,length,replacement_cost,rating,actor_key,actor_id,first_name,last_name,category_key,category_id,name,category_date_updated_key,actor_date_updated_key,film_date_updated_key
0,1,1,ACADEMY DINOSAUR,2006,6,0.99,86,20.99,PG,1.0,1.0,PENELOPE,GUINESS,306,6,Documentary,20060214,20060215.0,20060215
1,2,1,ACADEMY DINOSAUR,2006,6,0.99,86,20.99,PG,213.0,10.0,CHRISTIAN,GABLE,306,6,Documentary,20060214,20060215.0,20060215

In [37]:
# Demonstrate that the data warehouse exists and has the correct data by authoring select statements

# Each actor with their total number of movies
sql_fact_film = """
    SELECT first_name
        , last_name
        , COUNT(title) AS 'Number of Movies'
    FROM sakila.fact_film
    GROUP BY first_name
        , last_name
    ORDER BY 'Number of Movies' DESC;
"""

In [40]:
df_fact_film = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_fact_film)
df_fact_film.head(5)

  first_name last_name  Number of Movies
0   PENELOPE   GUINESS                19
1  CHRISTIAN     GABLE                22
2    LUCILLE     TRACY                30
3     SANDRA      PECK                19
4        BOB   FAWCETT                25

In [47]:
# Each actor and the number of different categories of movies
sql_fact_film = """
    SELECT first_name
        , last_name
        , COUNT(name) AS 'Number of Types of Movies'
    FROM sakila.fact_film
    GROUP BY first_name
        , last_name
        , name
    ORDER BY 'Number of Types of Movies' DESC;
"""

In [48]:
df_fact_film = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_fact_film)
df_fact_film.head(5)

  first_name last_name  Number of Types of Movies
0   PENELOPE   GUINESS                          1
1  CHRISTIAN     GABLE                          3
2    LUCILLE     TRACY                          4
3     SANDRA      PECK                          2
4        BOB   FAWCETT                          1